The part must be attached to straight.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationPartNotAttachedToStraight { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationPartNotAttachedToStraight As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationPartNotAttachedToStraight {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace